---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FieldDomainPoints Properties
FieldDomainPoints Class See Also Send Feedback
---

The FieldDomainPoints type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FieldDomainPoints Class

Autodesk.Revit.DB.Analysis Namespace